Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Sometimes it is necessary to get around this (for example, if you are implementing the above REPL).
ja: 場合によってはこれを回避する必要があります（たとえば、上記のREPLを実装している場合など）。

source: Sometimes, it's just convenient to be able to construct objects with fewer or different types of parameters than they have fields.
ja: 場合によっては、オブジェクトを構築することができます。 フィールドには、フィールドとは異なるタイプのパラメータが含まれています。

source: Sorting Functions
ja: ソート関数

source: Special Reference Syntax for ccall (deprecated):
ja: ccall(廃止された)のための特別なリファレンス構文:

source: Special floating-point values
ja: 特殊な浮動小数点値

source: Special functions
ja: 特殊な機能

source: Specifically :X => uuid goes in roots for each such X where uuid is defined as:
ja: 特にX=>uuidは、x15/>の各のルートであり、uuidは次のように定義されます。

source: Specifically:
ja: 具体的には、次のようになります。

source: Splatting interpolation
ja: スプラッティング補間

source: SquaresVector, we are able to define `setindex!`, and so we can mutate the array:
ja: SquaresVectorでは、'setindex!を定義することができます。 配列を突然変異させることができます

source: Stacked environments allow for augmentation of the primary environment with additional tools.
ja: スタック環境では、追加のツールを使用して、プライマリ環境の拡張を実現できます。

source: Standard Julia Alias
ja: 標準ジュリアエイリアス

source: Standard comparison operations are defined for all the primitive numeric types:
ja: 標準的な比較演算子は、全ての数値プリミティブ型に定義されています。

source: Standard functions to manipulate complex values are provided:
ja: 複雑な値を操作するための標準関数が用意されています。

source: Start some other operations that use f(x):
ja: 他のf(x)を使う操作を開始します。

source: Start up with the given system image file
ja: 指定されたシステムイメージファイルで起動する

source: Strided arrays must define a `strides(A)` method that returns a tuple of "strides" for each dimension; a provided `stride(A,k)` method accesses the kth element within this tuple.
ja: ストローブされた配列 は、各次元のタプルを返す`end(A)'メソッドを定義する必要があります。 `stride(A,k)'は、このタプル内のk番目のエレメントにアクセスします。

source: String Basics
ja: 文字列の基本

source: String literals are delimited by double quotes or triple double quotes:
ja: 文字列リテラルはダブルクオーテーションまたは3つのダブルクオーテーションで区切られます。:

source: String literals are encoded using the UTF-8 encoding.
ja: 文字列リテラルはUTF-8エンコードを使用してエンコードされます。

source: Strings are finite sequences of characters.
ja: 文字列は有限の記号の連続を意味します。

source: Struct Type correspondences
ja: 構造型の対応付け

source: SubArray is a specialization of AbstractArray that performs indexing by sharing memory with the original array rather than by copying it.
ja: サブアレイは、インデックス作成を実行するAbstractArrayの特殊化です。 コピーするのではなく、オリジナルのアレイとメモリを共有することです。

source: SubArray is a specialization of AbstractArray that performs indexing by sharing memory with the original array rather than by copying it. A SubArray
ja: サブアレイは、インデックス作成を実行するAbstractArrayの特殊化です。 コピーするよりも、元のアレイとのメモリを共有することです。サブアレイ

source: Subsequent characters may also include !
ja: 二文字目以降は、

source: Subsequently, however, an unrelated package also named Priv has been published and become popular.
ja: その後、Privという名前の無関係なパッケージが発行され、一般的になりました。

source: Such behaviour can be avoided by using ISO_C_BINDING and including bind(c) in the definition of the subroutine, which is strongly recommended for interoperable code.
ja: このような動作は、ISO_C_BINDINGを使用して回避することができます。 サブルーチンの定義にはbind(c)を含めることが強く推奨されます。このサブルーチンは、以下のように強く推奨されます。 相互運用可能なコードです。

source: Such definitions correspond to methods whose type signatures are UnionAll types (see UnionAll Types).
ja: そのような定義はシグネチャがUnionAll型であるメソッドに対応します(全合併型 参照)。

source: Such functions behave just like they would in traditional dynamically typed languages.
ja: そのような関数は、従来の動的型付け言語と同じように動作します。

source: Suppose the contents of DEPOT_PATH is ["/home/me/.julia", "/usr/local/julia"]; then Julia will look at the following paths to see if they exist:
ja: DEPOT_PATHの内容が["/home/me/.jula","/usr/local/julia"]であると仮定します。次に、Juliaは次のパスを参照して、それらが存在するかどうかを調べます。次のパスを参照してください:X21

source: Suppose we want to stop execution immediately if the square root of a negative number is taken.
ja: 負の数の平方根が取られた場合には、すぐに実行を停止したいと考えます。

source: Suppose we wanted to make the constructor call Point(1,2.5) work by "promoting" the integer value 1 to the floating-point value 1.0.
ja: コンストラクタの呼び出しPoint(1,2.5)work by"promote"を実行して、この整数を指定したいとします。 浮動小数点値を浮動小数点値1.0に値で指定します。

source: Suppose you call a function like this:
ja: 次のような関数を呼び出すとします。

source: Suppose you're developing an application called App, which uses two packages: Pub and Priv.
ja: Appというアプリケーションを開発していると仮定します。PubとPrivの2つのパッケージを使用しています。

source: Syntax
ja: 構文

source: Syntax / Keyword
ja: 構文/キーワード

source: Syntax Conflicts
ja: 構文の競合

source: System Independent:
ja: システムに依存しない:

source: System-dependent:
ja: システム依存:

source: T (*)(...) (e.g. a pointer to a function)
ja: T(*)(...)(例:関数へのポインタ)

source: T... (where T is one of the above types, variadic functions of different argument types are not supported)
ja: T.…(ここで、Tは、異なる引数タイプの変数はサポートされていません。)

source: T..., where T is the Julia type
ja: T.…は、Tはジュリア型である。

source: T is a primitive bits type and the tuple length is in the set {2-6,8-10,16}.
ja: Tはプリミティブビット型であり、タプル長はセット{2-6,8-10,16}にあります。

source: T is not known statically.
ja: Tは静的に認識されません。

source: T, where T is a Julia Leaf Type
ja: T。ここでTはJulia Leaf Typeである。

source: T, where T is a Julia leaf type
ja: Tは、TはJulia leaf型である。

source: T, where T is an equivalent Julia Bits Type (per the table above)
ja: Tは、Tであり、ここで、は、等価なジュリア・ビット型(上記表に基づく)である。

source: T, where T is one of the primitive types: char, int, long, short, float, double, complex, enum or any of their typedef equivalents
ja: TここでTはプリミティブ型の一つであり、char、int、、、、、、x12/>、、x15/>、x15/>、x15/>、x15/>、x15/>、x15/>、x15/>、x15/>である。 コンプレックス、enum、またはそれらのtypedef<X21/>等価物のいずれか

source: Taking any locks: C code you call out to may use locks internally, (for example, it is not problematic to call malloc, even though most implementations require locks internally) but don't attempt to hold or acquire any while executing Julia code.
ja: ロックを取る:呼び出し先のCコードは、内部的にロックを使用することがあります(たとえば、問題が発生しないようにします)。 mallocを呼び出すためには、ほとんどの実装は内部的にロックを必要としますが、実行しないでください。 は、ジュリア・コードの実行中に保持または取得されます。

source: Technically, the fusion stops as soon as a "non-dot" function call is encountered; for example, in sin.(sort(cos.(X))) the sin and cos
ja: 技術的には、融合はすぐに停止する。 "非ドット"関数呼び出しが発生します。たとえば、sin(sort(cos.(X)))sincosとcoscosとなります。

source: That allows the user to control the size.
ja: これによってユーザは サイズです。

source: That is, eps(x) yields a value of the same type as x such that x + eps(x) is the next representable floating-point value larger than x:
ja: すなわち、eps(x)は、xと同じタイプの値を生成し、それによって x + eps(x)は、 xより大きい次の表現可能浮動小数点値です。

source: That is, if a contained a reference to b and both a and b are due for garbage collection, there is no guarantee that b would be finalized after a.
ja: すなわち、aが含まれる場合 bへの参照と、aとbは、ガーベッジ・コレクションのためのものであり、保証するものではありません。 bは、aの後に最終的に確定されます。

source: That means that the values and types of local variables are not available at code generation time --- the code-generation code can only see the types of arguments.
ja: つまり、ローカル変数の値と型は、コード生成では使用できないということです。 time--コード生成コードは、引数の種類だけを見ることができます。

source: That supertype and those three methods are all it takes for SquaresVector to be an iterable, indexable, and completely functional array:
ja: そのスーパータイプと3は メソッドは、SquaresVectorを実行するために必要とされるものであり、これは、実行可能な、インデックス可能な、完全に機能するものです。 配列:

source: That's all there is to stacked environments.
ja: 環境を積み重ねることができるのです。

source: The Julia programming language fills this role: it is a flexible dynamic language, appropriate for scientific and numerical computing, with performance comparable to traditional statically-typed languages.
ja: Juliaはこのような目的のために開発されています。つまり、Juliaは柔軟な動的言語であると同時に、古くからの静的型付け言語と同等の性能を実現することで科学計算や数値計算に適してたものになっています。

source: The name of the script itself is passed in as the global PROGRAM_FILE.
ja: の スクリプト自体の名前は、グローバルなPROGRAM_FILEとして渡されます。

source: The 32-bit floating-point literal expression 1.5f22 could be interpreted as the numeric literal 1.5 multiplied by the variable f22.
ja: 32ビット浮動小数点リテラル式1f22は、数値リテラルとして解釈することができます。 1.5は、変数F22で乗算されます。

source: The eps function can also take a floating-point value as an argument, and gives the absolute difference between that value and the next representable floating point value.
ja: eps関数は、浮動小数点値を 引数は、その値と次の表現可能な値との間に絶対差を与えます。 浮動小数点値。

source: The -- delimiter can be used to separate command-line arguments intended for the script file from arguments intended for Julia:
ja: --デリミタは、July:を対象とした引数から、スクリプトファイルに対して指定されたコマンドライン引数を区切るために使用できます。

source: The -- delimiter can be used to separate command-line args to the scriptfile from args to Julia:
ja: --デリミタは、July:を対象とした引数から、スクリプトファイルに対して指定されたコマンドライン引数を区切るために使用できます。

source: The continue keyword accomplishes this:
ja: continueキーワードは、これを実現します：

source: The elseif and else blocks are optional, and as many elseif blocks as desired can be used.
ja: この、elseif および elseブロックは省略可能で、elseifブロックは、書いた数だけ使うことができます。

source: The for loop makes common repeated evaluation idioms easier to write.
ja: forループは、よくある繰り返し評価を、書きやすい慣用表現にしたものです。

source: The while loop evaluates the condition expression (i <= 5 in this case), and as long it remains true, keeps also evaluating the body of the while loop.
ja: while ループは、条件式 （この場合はi <= 5）を評価し、その式が真である間、whileループ本体の評価を続けます。

source: The ans variable is only bound in interactive sessions, not when Julia code is run in other ways.
ja: ans はインタラクティブ・セッションでのみ利用可能で、他の方法でJuliaのコードが実行された際には使うことができません。

source: The for loop iterates through these values, assigning each one in turn to the variable i.
ja: for ループはこれらの値を反復し、順番に変数iに代入します。

source: The & syntax is deprecated, use the Ref{T} argument type instead.
ja: &構文は廃止されます。代わりに、Ref{T}引数タイプを使用してください。

source: The 2x + y definition is only used in the first case, while the 2x - y definition is used in the others.
ja: 2x + yという定義は、最初の場合にだけ使われていますが、2x - yという定義が、その他では使われています。

source: The : character has two syntactic purposes in Julia.
ja: :文字は、Juliaでは2つの構文的な目的を持っています。

source: The (@ref man-numeric-literal-coefficients) does not work when constructing a complex number from variables.
ja: 複素数を構成する場合、(@ref man数値リテラル係数)は動作しません。 変数から。

source: The AbstractArray type includes anything vaguely array-like, and implementations of it might be quite different from conventional arrays.
ja: AbstractArrayタイプは、曖昧な配列を含んでおり、実装は実装されています。 従来のアレイとは大きく異なります。

source: The AbstractArray type includes anything vaguely array-like, and implementations of it might be quite different from conventional arrays. For example, elements might be computed on request rather than stored. However, any concrete AbstractArray{T,N} type should generally implement at least `size(A)` (returning an Int tuple), `getindex(A,i)` and (@ref getindex); mutable arrays should also implement `setindex!`. It is recommended that these operations have nearly constant time complexity, or technically Õ(1) complexity, as otherwise some array functions may be unexpectedly slow. Concrete types should also typically provide a `similar(A,T=eltype(A),dims=size(A))`
ja: AbstractArrayタイプは、曖昧な配列を含んでおり、実装は実装されています。 従来のアレイとはかなり異なります。たとえば、要求に対して要素が計算される場合があります。 ただし、保存するのではなく、すべての具体的なAbstractArray{T,N}タイプを実装する必要があります。 'size(A)'(return anIntタプルを返す)`getindex(A,i)`(@ref getindex); mutable配列は、'setindex!`を実装する必要があります。これらの操作を行うには、次の操作を行うことをお勧めします ほとんど一定の時間的複雑さ(技術的には1)、あるいは技術的には複雑さがある 関数は予期せぬほど遅くなります。具体的には、`同様(A、T=エルテープ(A)、dims=size(A))`を指定する必要があります。

source: The GNU Scientific Library (here assumed to be accessible through :libgsl) defines an opaque pointer, gsl_permutation *, as the return type of the C function gsl_permutation_alloc.
ja: GNU Scientific Library(ここではアクセス可能であると仮定される) :libgslは、Cの戻り型として、不透明ポインタgsl_substitutions*を定義している。 関数gsl_mutation_alloc。

source: The Pkg package manager ships with Julia 0.7/1.0 and lets you install and manage your projects' dependencies.
ja: PkgパッケージマネージャはJulia0.7/1.0と一緒に出荷され、プロジェクトの依存関係をインストールして管理することができます。

source: The Pub package is in the user depot, where packages installed by the user live.
ja: Pubパッケージはユーザーデポにあり、ユーザーがインストールしたパッケージはユーザーによってインストールされています。

source: The Rounding functions take a type T as an optional argument.
ja: Rounding functions は、 T型をオプション引数としてとります。

source: The `BigFloat` and `BigInt` types implements arbitrary-precision floating point and integer arithmetic, respectively.
ja: `BigFloat'と、"BigInt"型は実装されている。 任意精度浮動小数点および整数算術。

source: The `Cstring` type is essentially a synonym for Ptr{UInt8}, except the conversion to Cstring
ja: のCstring型は本質的にPtr{UInt8}の同義語であり、Cstringへの変換を除く。

source: The `Symbol` constructor takes any number of arguments and creates a new symbol by concatenating their string representations together:
ja: "シンボル"コンストラクタは任意の数の引数を取り、新しいシンボルを連結することによって新しいシンボルを作成します。 これらの文字列の表現は次のようになります。

source: The `dump` function provides indented and annotated display of Expr objects:
ja: `dump'関数は、Exprオブジェクトのインデントされた注釈付きの表示を提供します。

source: The `error` function is used to produce an `ErrorException` that interrupts the normal flow of control.
ja: 'エラー"関数は、'ErrorExceptionを生成するために使用されます。 制御の正常な流れです。

source: The `throw` function
ja: `throw'関数

source: The `typemin()` and `typemax()` functions also apply to floating-point types:
ja: `typemin()`および`typemax()`関数は浮動小数点型に対しても使用が可能です。

source: The `typemin` and `typemax` functions also apply to floating-point types:
ja: `テーパミン'と'テーペマス'関数も浮動小数点型に適用される。

source: The base argument is a pointer to an array of length nmemb, with elements of size bytes each.
ja: の基本引数は、nmembの配列へのポインタであり、サイズバイトの要素がある。 各。

source: The isless function is invoked by default, but the relation can be specified via the lt keyword.
ja: isless関数はデフォルトで呼び出されますが、関係は次のようになります。 はltキーワードで指定することができます。

source: The paths map assigns to each package UUID-name pair, the location of that package's entry-point source file.
ja: パスマップは、各パッケージUUIDの名前ペアに割り当て、そのパッケージのエントリポイントソースファイルの場所を指定します。

source: The primary environment—i.e. the first environment in a stack—is faithfully embedded in a stacked environment.
ja: スタックの中では、プライマリ環境-i.即ち最初の環境がスタック環境に忠実に埋め込まれています。

source: The promote function converts all its arguments to a common type -- in this case `Float64`.
ja: プロモート関数は、すべての引数を共通の型に変換します。この場合は、`Float64'のようになります。

source: The return Keyword
ja: returnキーワード

source: The same_type_numeric function behaves much like the same_type function defined above, but is only defined for pairs of numbers.
ja: このsame_type_numeric関数は、以前に定義した関数same_typeと非常によく似た動作をしますが、数値の組に対してのみ定義されています。

source: The try/catch statement
ja: try/catchステートメント

source: The try/catch statement allows for Exceptions to be tested for.
ja: try/catchステートメントでは、Exceptionsをテストすることができます。

source: The Zebra package can only be loaded by packages for which it appear as an explicit dependency in the manifest file: the Pub package and one of the Priv packages.
ja: Zebraパッケージは、マニフェスト・ファイルに明示的な依存関係として表示されるパッケージ(PubパッケージおよびPrivパッケージの一つ)でのみロードできます。

source: The `transcode()` function is provided to convert data between the various UTF-xx encodings, primarily for working with external data and libraries.
ja: `transcode()` 関数は、主に外部データやライブラリを扱うために、様々なUTF-xxエンコーディング間のデータ変換を提供します。

source: The reverse is present because merge favors the last argument rather than first when there are collisions between keys in its argument dictionaries.
ja: の逆方向は、mergeが、引数ディクショナリ内のキー間の衝突があるときに最初の引数ではなく、最後の引数を優先するためです。

source: The roots, graph and paths maps of a project environment are defined as follows.
ja: プロジェクト環境の<X21/>ルート、グラフ、の各パスは、次のように定義されています。

source: The `Base.broadcastable` function is called on each argument to broadcast, allowing it to return something different that supports axes and indexing.
ja: 'Base.broadcastable'関数は、各引数で呼び出され、ブロードキャストされます。 軸とインデックス作成をサポートするものとは異なるものを返すことです。

source: The AbstractArray fallback methods use `similar` to allocate an Array
ja: AbstractArrayフォールバックメソッドは'を使用して、アレイを割り当てます。

source: The `BigInt` and `BigFloat` types are available in Julia for arbitrary precision integer and floating point numbers respectively.
ja: Juliaでは任意精度整数と浮動小数点数のための The `BigInt` および `BigFloat` 型を利用いただけます。

source: The return on the last line could be omitted since it is the last expression.
ja: 最終行の returnは最後尾の式なので省略可能です。

source: The : character, followed by paired parentheses around a single statement of Julia code, produces an Expr object based on the enclosed code.
ja: :文字の後に続く Juliaコードの単一文の周りに括弧で括られた括弧によって、Exprオブジェクトを生成します。 を使用します。

source: The `Array` type is a specific instance of DenseArray; `Vector` and `Matrix` are aliases for the 1-d and 2-d cases.
ja: 「Array」タイプは、特定のインスタンスです。 DenseArray;'Vector'および'Matrix'は、1-dおよび2-dケースのエイリアスです。

source: The `eps()` function can also take a floating-point value as an argument, and gives the absolute difference between that value and the next representable floating point value.
ja: `eps()` 関数は、浮動小数点値を引数として使用したり、ある値と次の浮動小数点値との絶対差を 得ることができます。

source: The `eps` function can also take a floating-point value as an argument, and gives the absolute difference between that value and the next representable floating point value.
ja: 'eps'関数は、浮動小数点値を 引数は、その値と次の表現可能な値との間に絶対差を与えます。 浮動小数点値。

source: The C getenv function indicates an error by returning NULL, but other standard C functions indicate errors in various different ways, including by returning -1, 0, 1 and other special values.
ja: Cgetenv関数は、NULLを返すことによってエラーを示しますが、他の標準的なC関数の関数です。 -1 0 1、その他の特別な値を返すなど、さまざまな方法でエラーを表示します。

source: The C getenv function indicates an error by returning NULL, but other standard C functions indicate errors in various different ways, including by returning -1, 0, 1 and other special values. This wrapper throws an exception clearly indicating the problem if the caller tries to get a non-existent environment variable:
ja: Cgetenv関数は、NULLを返すことによってエラーを示しますが、他の標準的なC関数の関数です。 -1 0 1、その他の特別な値を返すなど、さまざまな方法でエラーを表示します。 このラッパーは、呼び出し者が存在しないことを示す問題を明確に示す例外をスローします。 環境変数:

source: The C function wrapped returns an integer error code; the results of the actual evaluation of the Bessel J function populate the Julia array result_array.
ja: C関数は、整数エラー・コードを返します。実際の評価結果は次のようになります。 Bessel J関数は、Julia配列result_arrayを生成します。

source: The Julia LOAD_PATH global defines an environment stack—the environment in which the Julia process operates.
ja: JuliaLOAD_PATHグローバルは、環境のスタックを定義します。環境スタックは、ジュリアプロセスが動作する環境を定義します。

source: The Julia Language
ja: Julia言語

source: The Julia Manual
ja: Julia言語

source: The Julia internal variable Sys.WORD_SIZE indicates whether the target system is 32-bit or 64-bit:
ja: Julia内部変数 Sys.WORD_SIZEは、ターゲットシステムが32ビット、または、64ビットであるかどうかを示します。

source: The Julia internal variable `Sys.WORD_SIZE` indicates whether the target system is 32-bit or 64-bit:
ja: Juliaの内部変数 `Sys.WORD_SIZE` はターゲットシステムが32ビットまたは64ビットのどちらかであることを示します。:

source: The ability to define function behavior across many combinations of argument types via multiple dispatch
ja: 多重ディスパッチ によってさまざまな引数の組み合わせごとに関数の振る舞いを定義できます

source: The above results are all Float64 values.
ja: 上記の結果は全て'Float64の値である。

source: The above results are all `Float64` values.
ja: 上記の結果は、全て`Float64` 値です。

source: The above syntactic enhancements significantly reduce the visual noise incurred when writing common mathematical formulae.
ja: 上記の構文の拡張機能は、同様な数式を記載する際の視覚的なノイズを低減します。

source: The actual allocation of the result array is handled by similar, using the Broadcasted object as its first argument.
ja: 結果配列の実際の割り当ては次のとおりです。 ブロードキャストオブジェクトを最初の引数として使用して、類似ので処理されます。

source: The application also depends on the Pub package, which in turn depends on the public Priv and the same Zebra package which the private Priv package depends on.
ja: アプリケーションは、Pubパッケージにも依存します。これは、パブリック<x/>Privによって異なります。また、プライベートPrivパッケージが依存する同じZebraパッケージに依存します。

source: The array library is implemented almost completely in Julia itself, and derives its performance from the compiler, just like any other code written in Julia.
ja: アレイ・ライブラリーは実装されています。 ほとんどの場合、ジュリア自身は、コンパイラーからのパフォーマンスを導き出し その他のコードはジュリアに書かれています。

source: The base Julia runtime provides only plain-text display, but richer displays may be enabled by loading external modules or by using graphical Julia environments (such as the IPython-based IJulia notebook).
ja: 基本的なJuliaランタイムはプレーンテキスト表示のみを提供しますが、よりリッチなディスプレイを有効にすることができます。 外部モジュールをロードするか、グラフィカルなJulia環境(IPythonベースのIJuliaなど)を使用する )を使用します。

source: The base array type in Julia is the abstract type `AbstractArray{T,N}`.
ja: ジュリアのベース・アレイ型は、抽象型の`AbstractArray{T,N}'である。

source: The base array type in Julia is the abstract type `AbstractArray{T,N}`. It is parameterized by the number of dimensions N and the element type T. `AbstractVector` and `AbstractMatrix` are aliases for the 1-d and 2-d cases. Operations on AbstractArray objects are defined using higher level operators and functions, in a way that is independent of the underlying storage. These operations generally work correctly as a fallback for any specific array implementation.
ja: Juliaの基本配列タイプは、抽象型'AbstractArray{T,N}'であり、パラメータ化されています。 次元の数Nおよび要素タイプT.'AbstractVector'および'AbstractMatrix'は 1dおよび2dケースのエイリアス。AbstractArrayオブジェクトに対する操作は、より高い値を使用して定義されます。 レベル演算子と関数は、基礎となるストレージとは無関係です。これらの操作は、次のような操作によって行われます。 一般的には、特定のアレイ実装のフォールバックとして正しく動作します。

source: The basic syntax for defining functions in Julia is:
ja: Juliaで関数を定義する基本構文は次のとおりです。

source: The behavior is found in most imperative programming languages having the && and || boolean operators: in a series of boolean expressions connected by these operators, only the minimum number of expressions are evaluated as are necessary to determine the final boolean value of the entire chain.
ja: 動作は &&とブール演算子を持つ最も命令的なプログラミング言語:シリーズ これらの演算子によって接続されたブール式のうち、最小の数だけが チェーン全体の最終的なブール値を決定するために必要な評価が行われます。

source: The blank lines actually have spaces on them.
ja: 空白行には実際にはスペースがあります。

source: The body becomes almost identical, but instead of calculating the linear index, we build up an expression that calculates the index:
ja: 体はほぼ同じですが 線形インデックスを計算する代わりに、インデックスを計算する式を構築します。

source: The broadcast style is computed for every broadcasting operation to allow for dispatch and specialization.
ja: ブロードキャスト・スタイルは、すべてのブロードキャスト・オペレーションに対して計算され 派遣・専門化。

source: The built-in broadcast machinery will then determine the result type and size based upon the arguments, allocate it, and then finally copy the realization of the Broadcasted object into it with a default copyto!(::AbstractArray, ::Broadcasted) method.
ja: 内蔵の ブロードキャスト・マシンは、引数に基づいて結果のタイプとサイズを決定し、割り当てます。 そして、最後に、ブロードキャストされたオブジェクトの実現をデフォルトでその中にコピーします。 copyto!(::AbstractArray,::ブロードキャスト)メソッド。

source: The built-in Exceptions listed below all interrupt the normal flow of control.
ja: 以下に挙げた標準装備の例外は、すべて、通常の制御の流れを中断します。

source: The built-in concrete type used for strings (and string literals) in Julia is `String`.
ja: Juliaにおける文字列を扱うビルトインの型は`String`です。

source: The built-in fallback broadcast and broadcast! methods similarly construct a transient Broadcasted representation of the operation so they can follow the same codepath.
ja: 組み込みのフォールバックブロードキャストと ブロードキャスト!メソッドは、同様に、操作の一時的な<X21/>ブロードキャスト表現を構成します。 同じコデパスにたどり着くことができます。

source: The call Point{Int64}(1,2) will invoke the definition Point{T}(x,y) inside the struct block.
ja: ポイント{Int64}(1,2)は、次のように定義ポイント{T}(x,y)を呼び出します。 構造体ブロック。

source: The callback you pass to C should only execute a `ccall` to :uv_async_send, passing cond.handle as the argument, taking care to avoid any allocations or other interactions with the Julia runtime.
ja: Cに渡されるコールバックは、`ccall'を実行して、:uv_async_sendを通過させるべきです。 cond.handleは引数として指定し、割り当てやその他の相互作用がないように注意してください。 Juliaランタイム。

source: The characters that English speakers are familiar with are the letters A, B, C, etc., together with numerals and common punctuation symbols.
ja: 英語話者にとって馴染みのある記号は A 、B 、C 、などの文字と、アラビア数字や句読記号です。

source: The choice of which method to execute when a function is applied is called dispatch.
ja: 実行するメソッドを、関数が適用される際に選択することを、ディスパッチと呼ばれます。

source: The code to be called must be available as a shared library.
ja: 呼び出されるコードは共有ライブラリとして使用できる必要があります。
